module.exports = {
    //系统端口
    port:3000,
    //数据库连接
    mongooseUrl:'mongodb://127.0.0.1:27017/pbAdmin',
    //运营数据
    operation:{
        //手动
        m:{
            key:'sys_operation_m',
            val:{
                label:'@考试,阅读,会议,投票,调查,活动',
                text:'发起率,参与率',
                data:'[[0,0,0,0,0,0],[0,0,0,0,0,0]]'
            }
        },
        //同步
        s:{
            key:'sys_operation_s',
            val:{
                label:'$考试,阅读,会议,投票,调查,活动',
                text:'发起率,参与率',
                data:'[[0,0,0,0,0,0],[0,0,0,0,0,0]]'
            }
        }
    },
    //支部设置
    branch:{
        key:'sys_branch_statistics',
        val:{
            data1:0, //支部数量：
            data2:0, //基层党组织：
            data3:0, //优秀党员：
            data4:0  //优秀工作者：
        }
    },
    //党员信息统计
    pb_statistics:{
        //发展党员分布

        //党员性别分布[男女]

        //党员党龄分布[1-10年、11-20年、21-30年、31-40年、41-50年、50年以上]

        //党员学历分布

        //党员年龄分布[25岁以下、26-35岁、36-45岁、46-55岁、56岁以上]
    },
    //各项数据显示方式
    display:{ //0同步、1手动、2所有
        key:'sys_data_display',
        val:{
            'd1':'1',  //支部
            'd2':'1',  //基层组织
            'd3':'1',  //学习宣传
            'd4':'1',  //学习宣传模块
            'd5':'1',  //党务工作
            'd6':'1',  //关注热文
            'd7':'1',  //党员信息
            'd8':'1',  //运营数据
            'd9':'1'   //党员统计
        }
    }
}